app/controllers/comentarios_controller.rb

  def show
    @comentario = Comentario.find(params[:id])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 980190962 LIMIT 1

  def edit
    @comentario = Comentario.find(params[:id])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 980190962 LIMIT 1

  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save
---
INSERT INTO `comentarios` (`comentavel_id`, `comentavel_type`, `conteudo`, `created_at`, `updated_at`) VALUES (1, 'MyString', 'MyText', '2012-12-18 17:41:02', '2012-12-18 17:41:02')

  def update
    @comentario = Comentario.find(params[:id])
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 980190962 LIMIT 1

  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 980190962 LIMIT 1
DELETE FROM `comentarios` WHERE `comentarios`.`id` = 980190962